In [67]:
import pandas as pd

In [68]:
emp_r = pd.read_csv("data/EmploymentRate/시도별_고용률(2010~2022,월별).csv",encoding='cp949')

In [69]:
df = emp_r

In [70]:
df.head()

,시도별,성별,항목,단위,2010.01 월,2010.02 월,2010.03 월,2010.04 월,2010.05 월,2010.06 월,...,2022.04 월,2022.05 월,2022.06 월,2022.07 월,2022.08 월,2022.09 월,2022.10 월,2022.11 월,2022.12 월,Unnamed: 160
0,계,계,15세이상인구[천명],천명,40594.6,40630.2,40667.3,40703.2,40747.7,40788.1,...,45233.4,45245.1,45248.5,45257.6,45270.4,45283.5,45302.1,45317.6,45331.7,NaN
1,계,계,경제활동인구[천명],천명,24258.3,24217.0,24567.1,25052.5,25292.7,25352.3,...,28942.1,29373.9,29366.1,29311.0,29024.5,29092.7,29110.0,29086.5,28673.9,NaN
2,계,계,비경제활동인구[천명],천명,16336.3,16413.2,16100.2,15650.7,15455.0,15435.8,...,16291.3,15871.3,15882.3,15946.6,16245.9,16190.8,16192.0,16231.1,16657.8,NaN
3,계,계,경제활동참가율[%],%,59.8,59.6,60.4,61.5,62.1,62.2,...,64.0,64.9,64.9,64.8,64.1,64.2,64.3,64.2,63.3,NaN
4,계,계,실업률[%],%,5.0,4.8,4.1,3.7,3.2,3.5,...,3.0,3.0,3.0,2.9,2.1,2.4,2.4,2.3,3.0,NaN

In [71]:
df['시도별'].nunique()

18

In [72]:
df['시도별'].unique()

array(['계', '서울특별시', '부산광역시', '대구광역시', '인천광역시', '광주광역시', '대전광역시', '울산광역시',
       '세종특별자치시', '경기도', '강원도', '충청북도', '충청남도', '전라북도', '전라남도', '경상북도',
       '경상남도', '제주도'], dtype=object)

In [73]:
col = ['전국',
 '서울특별시',
 '부산광역시',
 '대구광역시',
 '인천광역시',
 '광주광역시',
 '대전광역시',
 '울산광역시',
 '세종특별자치시',
 '경기도',
 '강원도',
 '충청북도',
 '충청남도',
 '전라북도',
 '전라남도',
 '경상북도',
 '경상남도',
 '제주특별자치도']

In [74]:
len(col)

18

In [75]:
df['성별'].unique()

array(['계', '남자', '여자'], dtype=object)

In [76]:
df['항목'].unique()

array(['15세이상인구[천명]', '경제활동인구[천명]', '비경제활동인구[천명]', '경제활동참가율[%]', '실업률[%]',
       '고용률[%]', '15~64세 고용률[%]'], dtype=object)

In [77]:
df = df[df['성별'] == '계']

In [78]:
df = df[df['항목'] == '고용률[%]']

In [79]:
df = df.drop(columns=['시도별','단위','성별','항목','Unnamed: 160'])

In [80]:
col2 = df.columns.to_list()

In [81]:
col2

['2010.01 월',
 '2010.02 월',
 '2010.03 월',
 '2010.04 월',
 '2010.05 월',
 '2010.06 월',
 '2010.07 월',
 '2010.08 월',
 '2010.09 월',
 '2010.10 월',
 '2010.11 월',
 '2010.12 월',
 '2011.01 월',
 '2011.02 월',
 '2011.03 월',
 '2011.04 월',
 '2011.05 월',
 '2011.06 월',
 '2011.07 월',
 '2011.08 월',
 '2011.09 월',
 '2011.10 월',
 '2011.11 월',
 '2011.12 월',
 '2012.01 월',
 '2012.02 월',
 '2012.03 월',
 '2012.04 월',
 '2012.05 월',
 '2012.06 월',
 '2012.07 월',
 '2012.08 월',
 '2012.09 월',
 '2012.10 월',
 '2012.11 월',
 '2012.12 월',
 '2013.01 월',
 '2013.02 월',
 '2013.03 월',
 '2013.04 월',
 '2013.05 월',
 '2013.06 월',
 '2013.07 월',
 '2013.08 월',
 '2013.09 월',
 '2013.10 월',
 '2013.11 월',
 '2013.12 월',
 '2014.01 월',
 '2014.02 월',
 '2014.03 월',
 '2014.04 월',
 '2014.05 월',
 '2014.06 월',
 '2014.07 월',
 '2014.08 월',
 '2014.09 월',
 '2014.10 월',
 '2014.11 월',
 '2014.12 월',
 '2015.01 월',
 '2015.02 월',
 '2015.03 월',
 '2015.04 월',
 '2015.05 월',
 '2015.06 월',
 '2015.07 월',
 '2015.08 월',
 '2015.09 월',
 '2015.10 월',
 '2015.11 월',
 '2015.12 월',
 '2016.01 월',
 '2016.02 월',
 '2016.03 월',
 '2016.04 월',
 '2016.05 월',
 '2016.06 월',
 '2016.07 월',
 '2016.08 월',
 '2016.09 월',
 '2016.10 월',
 '2016.11 월',
 '2016.12 월',
 '2017.01 월',
 '2017.02 월',
 '2017.03 월',
 '2017.04 월',
 '2017.05 월',
 '2017.06 월',
 '2017.07 월',
 '2017.08 월',
 '2017.09 월',
 '2017.10 월',
 '2017.11 월',
 '2017.12 월',
 '2018.01 월',
 '2018.02 월',
 '2018.03 월',
 '2018.04 월',
 '2018.05 월',
 '2018.06 월',
 '2018.07 월',
 '2018.08 월',
 '2018.09 월',
 '2018.10 월',
 '2018.11 월',
 '2018.12 월',
 '2019.01 월',
 '2019.02 월',
 '2019.03 월',
 '2019.04 월',
 '2019.05 월',
 '2019.06 월',
 '2019.07 월',
 '2019.08 월',
 '2019.09 월',
 '2019.10 월',
 '2019.11 월',
 '2019.12 월',
 '2020.01 월',
 '2020.02 월',
 '2020.03 월',
 '2020.04 월',
 '2020.05 월',
 '2020.06 월',
 '2020.07 월',
 '2020.08 월',
 '2020.09 월',
 '2020.10 월',
 '2020.11 월',
 '2020.12 월',
 '2021.01 월',
 '2021.02 월',
 '2021.03 월',
 '2021.04 월',
 '2021.05 월',
 '2021.06 월',
 '2021.07 월',
 '2021.08 월',
 '2021.09 월',
 '2021.10 월',
 '2021.11 월',
 '2021.12 월',
 '2022.01 월',
 '2022.02 월',
 '2022.03 월',
 '2022.04 월',
 '2022.05 월',
 '2022.06 월',
 '2022.07 월',
 '2022.08 월',
 '2022.09 월',
 '2022.10 월',
 '2022.11 월',
 '2022.12 월']

In [83]:
df = df.transpose()

In [84]:
df['연월']=col2

In [89]:
col.append('연월')

In [90]:
df

,5,26,47,68,89,110,131,152,173,194,215,236,257,278,299,320,341,362,연월
2010.01 월,56.8,57.6,54.1,55.6,57.9,55.7,55.1,57.7,NaN,57.7,49.7,53.9,55.4,53.4,61.2,57.4,57.4,65.1,2010.01 월
2010.02 월,56.7,57.8,53.9,55.5,57.7,56.0,54.8,57.3,NaN,57.1,49.6,55.3,55.7,53.9,62.3,57.9,57.3,63.5,2010.02 월
2010.03 월,57.9,58.3,54.3,56.9,58.6,57.3,55.4,58.1,NaN,58.4,51.7,58.8,57.9,56.0,62.4,60.5,58.8,64.8,2010.03 월
2010.04 월,59.2,59.2,54.5,57.6,59.9,57.4,56.2,59.0,NaN,59.6,56.3,61.1,61.3,57.8,63.4,63.3,60.2,64.5,2010.04 월
2010.05 월,60.1,60.0,55.5,57.9,60.6,58.4,57.2,59.5,NaN,60.2,59.0,61.3,62.2,59.5,64.1,64.7,60.9,65.8,2010.05 월
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2022.08 월,62.8,60.7,58.0,59.7,63.3,59.0,62.2,60.0,64.7,64.5,64.0,65.9,66.4,63.2,67.0,64.0,61.1,70.3,2022.08 월
2022.09 월,62.7,60.7,57.8,59.7,63.6,59.0,61.9,59.9,64.3,64.3,64.1,65.4,66.5,63.3,67.6,63.4,61.1,70.5,2022.09 월
2022.10 월,62.7,60.5,57.7,59.5,63.6,59.6,62.6,60.0,64.2,64.2,63.9,65.9,67.1,63.3,67.3,64.2,61.4,72.2,2022.10 월
2022.11 월,62.7,60.8,57.8,59.3,63.9,59.7,62.4,60.3,64.4,63.9,63.3,65.7,66.2,63.1,67.9,63.8,61.8,72.1,2022.11 월
2022.12 월,61.3,60.8,57.6,58.5,62.5,58.2,62.3,59.1,63.1,63.0,58.2,63.3,61.9,59.0,65.0,60.9,60.2,70.7,2022.12 월

In [91]:
df.columns = col

In [92]:
df = df.melt(id_vars=['연월'], value_vars=['서울특별시', '부산광역시', '대구광역시', '인천광역시', '광주광역시', '대전광역시',
       '울산광역시', '세종특별자치시', '경기도', '강원도', '충청북도', '충청남도', '전라북도', '전라남도',
       '경상북도', '경상남도', '제주특별자치도'], var_name='시도', value_name='고용률')

In [93]:
df

             연월       시도   고용률
0     2010.01 월    서울특별시  57.6
1     2010.02 월    서울특별시  57.8
2     2010.03 월    서울특별시  58.3
3     2010.04 월    서울특별시  59.2
4     2010.05 월    서울특별시  60.0
...         ...      ...   ...
2647  2022.08 월  제주특별자치도  70.3
2648  2022.09 월  제주특별자치도  70.5
2649  2022.10 월  제주특별자치도  72.2
2650  2022.11 월  제주특별자치도  72.1
2651  2022.12 월  제주특별자치도  70.7

[2652 rows x 3 columns]

In [94]:
year_month = []
for i in range(len(df)):
    ym = df['연월'][i].split(' 월')[0]
    year_month.append(ym)
df['연월'] = year_month

In [95]:
df

           연월       시도   고용률
0     2010.01    서울특별시  57.6
1     2010.02    서울특별시  57.8
2     2010.03    서울특별시  58.3
3     2010.04    서울특별시  59.2
4     2010.05    서울특별시  60.0
...       ...      ...   ...
2647  2022.08  제주특별자치도  70.3
2648  2022.09  제주특별자치도  70.5
2649  2022.10  제주특별자치도  72.2
2650  2022.11  제주특별자치도  72.1
2651  2022.12  제주특별자치도  70.7

[2652 rows x 3 columns]

In [97]:
year = []
month = []
for i in range(len(df)):
    y = df['연월'][i].split('.')[0]
    m = df['연월'][i].split('.')[1]
    if m == '1':
        m = '10'
    year.append(y)
    month.append(m)    
df['연도'] = year
df['월'] = month

In [98]:
df

           연월       시도   고용률    연도   월
0     2010.01    서울특별시  57.6  2010  01
1     2010.02    서울특별시  57.8  2010  02
2     2010.03    서울특별시  58.3  2010  03
3     2010.04    서울특별시  59.2  2010  04
4     2010.05    서울특별시  60.0  2010  05
...       ...      ...   ...   ...  ..
2647  2022.08  제주특별자치도  70.3  2022  08
2648  2022.09  제주특별자치도  70.5  2022  09
2649  2022.10  제주특별자치도  72.2  2022  10
2650  2022.11  제주특별자치도  72.1  2022  11
2651  2022.12  제주특별자치도  70.7  2022  12

[2652 rows x 5 columns]

In [99]:
# df.to_csv('2010~2022_고용률.csv')